    【スマートコントラクタ開発】
    ①イーサリアムクライアントのインストール（イーサリアムブロックチェーンとのやりとりに利用できるソフトウェア）
    ②Node.jsのインストール（Truffle用のJS環境）
    ③Truffle Suite から　Truffle（コントラクトのテストとデプロイ用のユーティリティ） と　Ganache（アプリをローカルで実行するためのローカルブロックチェーン環境の提供） のインストール
    
    
    JSON-RPC API .. 軽量なRPC（Remote Procedure Call）プロトコル。JSONを使ってサーバーにリクエストを送信すると、定義された処理が実行される。チェーンとのやりとりに使う。
    イーサリアムクライアントの種類 .. Parity
    
    【ブロックチェーンのローカル開発環境作成ながれ】
    Prity　でイーサリアムクライアントのセットアップ　と　　Goerliでテストネットワークとの同期　が含まれる
    MetaMask でブラウザとDaapとやりとり。
    Node.jsでJS環境
    Truffle Suite から　Truffle（ユーティリティツール） と　Ganache（自分専用のブロックチェーンで　チェーンに接続して読み書きするための　JSON-RPC APIサーバーを実行する。） をインストール
   
   
   
   
    
